In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# !pip install mysqlclient

Collecting mysqlclient
  Downloading mysqlclient-2.0.2-cp38-cp38-win_amd64.whl (179 kB)
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.0.2

WARNING: You are using pip version 20.3.1; however, version 20.3.3 is available.
You should consider upgrading via the 'c:\programdata\anaconda3\python.exe -m pip install --upgrade pip' command.

In [3]:
import MySQLdb as sqldb

In [4]:
db = sqldb.connect(host = 'localhost',port = 3306, user = 'root', passwd = '1234',charset = 'utf8')

In [6]:
cursor = db.cursor()

In [7]:
sql = '''
show databases;
'''
cursor.execute(sql)
cursor.fetchall()

(('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',))

In [8]:
sql = '''
drop database if exists testdb;
create database testdb;
'''
cursor.execute(sql)
cursor.fetchall()

()

In [12]:
sql = '''
use testdb;
'''
cursor.execute(sql)

0

In [13]:
sql = '''
create table mytable(
    no int not null auto_increment,
    name char(20) not null,
    age tinyint,
    phone varchar(20),
    address varchar(50),
    primary key(no)
);
'''
cursor.execute(sql)0

0

In [14]:
sql = '''
desc mytable;
'''
cursor.execute(sql)
cursor.fetchall()

(('no', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('name', 'char(20)', 'NO', '', None, ''),
 ('age', 'tinyint', 'YES', '', None, ''),
 ('phone', 'varchar(20)', 'YES', '', None, ''),
 ('address', 'varchar(50)', 'YES', '', None, ''))

In [23]:
sql = '''
drop table if exists mytable;
'''
cursor.execute(sql)
cursor.fetchall()

()

In [24]:
sql = '''
create table mytable(
    no int not null auto_increment,
    name char(20) not null,
    age_num tinyint,
    phone varchar(20),
    address varchar(50),
    primary key(no)
);
'''
cursor.execute(sql)
cursor.fetchall()

()

In [25]:
sql = '''
alter table mytable change column age_num age int null;
'''
cursor.execute(sql)

0

##### 테이블 값 입력
    insert into 테이블명 (col1, col2 ...) values(val1, val2..)

In [30]:
sql = '''
create table mytable1 (
    id int not null auto_increment primary key,
    name varchar(50) not null,
    model_num varchar(10) not null,
    model_type varchar(30) not null
);
'''
cursor.execute(sql)
cursor.fetchall()

()

In [32]:
sql = '''
insert into mytable1 (name, model_num, model_type) values("i7","7700","kaby lake");
insert into mytable1 (name, model_num, model_type) values("i7","7500","kaby lake");
insert into mytable1 (name, model_num, model_type) values("i7","7700k","kaby lake");
insert into mytable1 (name, model_num, model_type) values("i7","g4600","kaby lake");
insert into mytable1 (name, model_num, model_type) values("i7","7600","kaby lake");
'''
cursor.execute(sql)
cursor.fetchall()

()

In [33]:
sql = '''
select * from mytable1;
'''
cursor.execute(sql)
cursor.fetchall()

((1, 'i7', '7700', 'kaby lake'),
 (2, 'i7', '7500', 'kaby lake'),
 (3, 'i7', '7700k', 'kaby lake'),
 (4, 'i7', 'g4600', 'kaby lake'),
 (5, 'i7', '7600', 'kaby lake'))

In [36]:
sql = '''
select name as cpu_name, model_num cpu_num from mytable1;
'''
cursor.execute(sql)
cursor.fetchall()

(('i7', '7700'),
 ('i7', '7500'),
 ('i7', '7700k'),
 ('i7', 'g4600'),
 ('i7', '7600'))

In [37]:
sql = '''
select * from mytable1 order by id desc;
'''
cursor.execute(sql)
cursor.fetchall()

((5, 'i7', '7600', 'kaby lake'),
 (4, 'i7', 'g4600', 'kaby lake'),
 (3, 'i7', '7700k', 'kaby lake'),
 (2, 'i7', '7500', 'kaby lake'),
 (1, 'i7', '7700', 'kaby lake'))

##### 조건검색 : where

In [38]:
sql = """
select * from mytable1 where id < 3;
"""
cursor.execute(sql)
cursor.fetchall()

((1, 'i7', '7700', 'kaby lake'), (2, 'i7', '7500', 'kaby lake'))

In [39]:
sql = """
select * from mytable1 where id < 3 or name='i7';
"""
cursor.execute(sql)
cursor.fetchall()

((1, 'i7', '7700', 'kaby lake'),
 (2, 'i7', '7500', 'kaby lake'),
 (3, 'i7', '7700k', 'kaby lake'),
 (4, 'i7', 'g4600', 'kaby lake'),
 (5, 'i7', '7600', 'kaby lake'))

In [40]:
sql = """
select * from mytable1 where name like 'i%';
"""
cursor.execute(sql)
cursor.fetchall()

((1, 'i7', '7700', 'kaby lake'),
 (2, 'i7', '7500', 'kaby lake'),
 (3, 'i7', '7700k', 'kaby lake'),
 (4, 'i7', 'g4600', 'kaby lake'),
 (5, 'i7', '7600', 'kaby lake'))

In [41]:
sql = """
select * from mytable1 where name like 'i%' limit 2;
"""
cursor.execute(sql)
cursor.fetchall()

((1, 'i7', '7700', 'kaby lake'), (2, 'i7', '7500', 'kaby lake'))

##### table value 수정

In [43]:
sql = """
update mytable1 set name = 'i5', model_num = '5500' where id = 3;
"""
cursor.execute(sql)
cursor.fetchall()

()

In [44]:
sql = """
select * from mytable1;
"""
cursor.execute(sql)
cursor.fetchall()

((1, 'i7', '7700', 'kaby lake'),
 (2, 'i7', '7500', 'kaby lake'),
 (3, 'i5', '5500', 'kaby lake'),
 (4, 'i7', 'g4600', 'kaby lake'),
 (5, 'i7', '7600', 'kaby lake'))

In [45]:
sql = """
desc mytable1;
"""
cursor.execute(sql)
cursor.fetchall()

(('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('name', 'varchar(50)', 'NO', '', None, ''),
 ('model_num', 'varchar(10)', 'NO', '', None, ''),
 ('model_type', 'varchar(30)', 'NO', '', None, ''))

In [46]:
sql = """
update mytable1 set model_type = 'gogo lake' where id = 2;
"""
cursor.execute(sql)
cursor.fetchall()

()

In [47]:
sql = """
select * from mytable1;
"""
cursor.execute(sql)
cursor.fetchall()

((1, 'i7', '7700', 'kaby lake'),
 (2, 'i7', '7500', 'gogo lake'),
 (3, 'i5', '5500', 'kaby lake'),
 (4, 'i7', 'g4600', 'kaby lake'),
 (5, 'i7', '7600', 'kaby lake'))

In [48]:
sql = """
create table product (
    product_code varchar(20) not null primary key,
    title varchar(200) not null,
    ori_price int,
    discount_price int,
    discount_percent int,
    delivery varchar(2)    
);
"""
cursor.execute(sql)
cursor.fetchall()

()

In [49]:
sql = """
show tables;
"""
cursor.execute(sql)
cursor.fetchall()

(('mytable',), ('mytable1',), ('product',))

In [60]:
for index in range(10):
    product_code = 1000 + index + 1
    sql = "insert into product values " + str(product_code) + ", '스위트니 여름 신상', 2300, 6900, 70, 'F'";
    print(sql)
    cursor.execute(sql)

insert into product values 1001, '스위트니 여름 신상', 2300, 6900, 70, 'F'

ProgrammingError: (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '1001, '스위트니 여름 신상', 2300, 6900, 70, 'F'' at line 1")